{"id":214,"date":"2016-01-13T12:54:22","date_gmt":"2016-01-13T12:54:22","guid":{"rendered":"http:\/\/www.201m.net\/compulink\/?page_id=214"},"modified":"2016-01-13T12:54:22","modified_gmt":"2016-01-13T12:54:22","slug":"testimonials","status":"publish","type":"page","link":"https:\/\/www.compu-links.com\/testimonials","title":{"rendered":"Testimonials"},"content":{"rendered":"<p><strong>Joseph M Aucoin, <a href=\"http:\/\/www.petersonrealty.com\/\">Peterson Realty<\/a>, Harwich<\/strong><\/p>\n<p><em> “I am writing to you at this time to express my appreciation for your g.wiz! (aka RealtyInSite) software.  This software is a tool that every Realtor should have.  Information is simple to find and with the push of a button reports are produced.   As a software developer and Realtor, I would recommend this valuable software.”<\/em><\/p>\n<p><strong>Kitsi Dewey, <a href=\"http:\/\/www.realestateassc.com\/index.ccml\">Real Estate Associates<\/a>, Falmouth<\/strong><\/p>\n<p><em>“Initially I was a bit wary about the program, having been used to Falview and using the town&#8217;s website for updates. Doing mailings with Falview, however, was a big problem, as the updates were annual.<\/em><\/p>\n<p><em>With g.wiz! (aka RealtyInSite), having the weekly updates has been fantastic, and using the program is now &#8220;a piece of cake.&#8221; Being able to get so much information so easily has been a great help to all of the agents with Real Estate Associates and to the secretaries as well. <\/em><\/p>\n<p><em>You have been extremely helpful with &#8220;tech support&#8221; and very open to suggestions, and for that I want to thank you. Taking the time to come into the office and sit with me a few weeks ago was just wonderful!”<\/em><\/p>\n<p><strong>Ellen Ferson, <a href=\"http:\/\/www.jolymcabeeweinert.com\/falmouth.htm\">Coldwell Banker &#8211; Joly, McAbee, Weinert Realty<\/a>, Falmouth<\/strong><\/p>\n<p><em>&#8221; g.wiz! (aka RealtyInSite) has proven to be a valuable asset for me as a Real Estate Broker. Access to documentation that previously would have taken me days to obtain is now readily available within moments with the g.wiz! (aka RealtyInSite) program. My customers and clients especially appreciate the property-specific aerial and topographical views. g.wiz! (aka RealtyInSite) gives me a decided advantage in a very competitive industry.&#8221;<\/em><\/p>\n<p><strong>George Goodspeed, <a href=\"http:\/\/www.sylvanrealty.com\/\">Sylvan Realty<\/a>, Chatham<\/strong><\/p>\n<p><em>“We have been using the g.wiz! (aka RealtyInSite) program for about three months and we are finding it very useful in collecting information on properties both from the sales side and the listing side. It is helping us to determine suggested sale prices when we are working with the sellers in listing their property, and it is a big help with our advertising program. We are saving a great amount of time with mailings due to the label portion of the software.<\/em><\/p>\n<p><em>We suggest that one person in the office become familiar with the software to help train other members of the sales force.”<\/em><\/p>\n<p><strong>Melissa Hannigan, <a href=\"http:\/\/www.jolymcabeeweinert.com\/falmouth.htm\">Coldwell Banker &#8211; Joly, McAbee, Weinert Realty<\/a>, Falmouth <\/strong><\/p>\n<p><em>&#8220;I am sending this email to let you know how useful the g.wiz! (aka RealtyInSite) program has been to our company. <\/em><\/p>\n<p><em>Tasks that have required many steps are now available at the click of the mouse, all in one easy program. The property maps are especially impressive. The aerial maps and property boundary maps are very effective in a presentation, as well as the many other available maps that can be accessed. <\/em><\/p>\n<p><em>When farming the summary report is a great source of information, and the label option is also a major time saver. We have also found that the information is quite up to date and reflects new property changes quickly. <\/em><\/p>\n<p><em>g.wiz! (aka RealtyInSite) is also constantly adjusting the program to make it more user friendly. It is nice to be able to make suggestions and actually have them acted on. <\/em><\/p>\n<p><em>We thank you for creating a product that has made tasks at hand easier to accomplish.&#8221;<\/em><\/p>\n<p><strong>Kathy Harding, <a href=\"http:\/\/www.hardingrealtycorp.com\/\">Realty Executives<\/a>, Cataumet<\/strong><\/p>\n<p><em>“g.wiz! (aka RealtyInSite) provides us with instant access to the information our clients need to help them make decisions about the purchase and sale of properties.  It is a user friendly software that has become an integral part of our business.   We have been well served by the staff and appreciate their openness to our questions and suggestions.  In short, we think g.wiz! (aka RealtyInSite) is deserving of its name. “<\/em><\/p>\n<p><strong>Ruth Kelley, <a href=\"http:\/\/www.hardingrealtycorp.com\/\">Realty Executives<\/a>, Cataumet<\/strong><\/p>\n<p><em>&#8221; g.wiz! (aka RealtyInSite) is an excellent tool for the real estate professional. The program is very user friendly and provides relevant information for all aspects of my work. I especially like the aerial maps which I use for prospective tenants to show the proximity of the beach to a particular rental property. It is a great tool for comparative market work and for owner information. I would recommend this tool for all persons dealing with Real Estate.”<\/em><\/p>\n<p><strong>Dick Martin, <a href=\"http:\/\/www.suretterealty.com\/\">Martin Surette Realty<\/a>, Yarmouth<\/strong><\/p>\n<p><em>“g.wiz! (aka RealtyInSite) has been a wonderful tool for us in working with both buyers and sellers in making listing packets more thorough and by providing visual aids for buyers to get a better understanding of a listing.”<\/em><\/p>\n<p><strong>Jim McCollum, <a href=\"http:\/\/www.trurorealestate.com\/\">Truro Real Estate<\/a>, Truro<\/strong><\/p>\n<p><em>“g.wiz! (aka RealtyInSite) has been invaluable in the office in numerous ways.<\/em><\/p>\n<p><em>First, customers and clients are just fascinated and amazed at the ability to get an aerial view of their own property or properties they are interested in. It gives them a unique view of the property and its relationship to the neighborhood, the town and the beaches.<\/em><\/p>\n<p><em>The ability to see a map with last sales prices, comparables or recent sales on all the properties is a terrific way to help listing clients determine the correct selling price for their own property and it helps buyers evaluate asking prices on properties of interest.<\/em><\/p>\n<p><em>The ability to save the maps and aerial views in jpeg format makes it easy to add a professional map to advertisements and MLS listings. You can also bring these images into drawing or photo software and draw and write on them, pointing out specific features, and then e-mail the information to a customer or client. A picture is really sometimes worth a thousand words.<\/em><\/p>\n<p><em>The quick search capability by name, parcel number or address makes it easy to locate a property and the assessor information (updated weekly) saves the time and effort it takes to find this information by other methods, it makes this information very accessible.<\/em><\/p>\n<p><em>The ability to import an MLS search of multiple properties locates the properties on the map making it easy for customers to locate the listings to drive by the properties on there own. It also puts all the pertinent information on the listings at your fingertips very quickly.”<\/em><\/p>\n<p><strong>Thomas Peterson, <a href=\"http:\/\/www.petersonrealty.com\/\">Peterson Realty<\/a>, Harwich<\/strong><\/p>\n<p><em>“g.wiz! (aka RealtyInSite) is an invaluable tool that gives my firm a leg up on the competition. It&#8217;s a great product.”<\/em><\/p>\n<p><strong>Alan Poretti, <a href=\"http:\/\/www.realestateassc.com\/\">Real Estate Associates<\/a>, Falmouth<\/strong><\/p>\n<p><em>“I have found g.wiz! (aka RealtyInSite) to be a valuable tool in both the selling and listing of real estate. It easily shows the perspective customer facts about any particular property that are informative and easy to understand and recognize. It&#8217;s ease of use and information base has definitely made my job a lot easier. Thank you.”<\/em><\/p>\n<p><strong>Pam Priestley, <a href=\"http:\/\/www.pampriestley.com\/\">Realty Executives<\/a>, Sandwich<\/strong><\/p>\n<p><em>“I have found g.wiz! (aka RealtyInSite) so much easier to use than Banker &amp; Tradesman.  I rely on it as the most up to date data source for marketing and CMA&#8217;s.”<\/em><\/p>\n<p><strong>Sandy Tompkins, <a href=\"http:\/\/www.jolymcabeeweinert.com\/falmouth.htm\">Coldwell Banker &#8211; Joly, McAbee, Weinert Realty<\/a>, Sandwich<\/strong><\/p>\n<p><em>“I just wanted to let you know how much I like g.wiz! (aka RealtyInSite). I am most impressed with the aerial views that I can print out for my clients. This is especially impressive with properties that are located near the ocean. It helps everyone to see how close the water is. I also like the fact that the most recent sales are available to me when I am trying to do a Comparative Market Analysis. All and all I really like the whole program. <\/em><\/p>\n<p><em>Thank you for a great tool to work with. “<\/em><\/p>\n<p><strong>Mike Turner, <a href=\"http:\/\/www.beachrealtycapecod.com\/\">Beach Realty<\/a>, Sandwich <\/strong><\/p>\n<p><em>“I have found g.wiz! (aka RealtyInSite) to be very helpful in my daily business.  I use the aerial photos to help potential homebuyers see proximity to the water.  I find the index search combined with the export data feature very helpful for CMA research &amp; presentation.  The lot dimension view if very helpful for getting the info in a size you can read.  I find something new all the time as I explore using the product.”<\/em><\/p>\n<p><strong>Geri Vaterlaus, <a href=\"http:\/\/www.geriv.com\/\">Hopper Real Estate<\/a>, Eastham<\/strong><\/p>\n<p><em>“Honestly, g.wiz! (aka RealtyInSite) has become invaluable to me.  I have been able to bring up data that would otherwise either be unavailable immediately or that I would have to search long and hard to find for my customers.<\/em><\/p>\n<p><em>The program has been so helpful for both buyers and sellers alike.  In the past couple of weeks, especially, I have used your maps to indicate to buyers just where the home is located on the lot (aerial view &#8211; VERY important), the lot dimensions and comparable price ranges of homes in the neighborhoods.  Because of these tools, two of my buyers have placed offers on properties in Eastham that have been accepted!<\/em><\/p>\n<p><em>As for sellers, performing a Comparative Market Analysis has become a breeze taking much less time and affording my customers much more information than ever.<\/em><\/p>\n<p><em>Thanks so much for introducing me to this program, and I wish you good luck in the future.”<\/em><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Joseph M Aucoin, Peterson Realty, Harwich  “I am writing to you at this time to express my appreciation for your g.wiz! (aka RealtyInSite) software.  This software is a tool that every Realtor should have.  Information is simple to find and<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/214"}],"collection":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/comments?post=214"}],"version-history":[{"count":0,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/214\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/media?parent=214"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}