{"id":217,"date":"2016-01-13T13:07:35","date_gmt":"2016-01-13T13:07:35","guid":{"rendered":"http:\/\/www.201m.net\/compulink\/?page_id=217"},"modified":"2016-04-07T13:31:41","modified_gmt":"2016-04-07T13:31:41","slug":"the-history","status":"publish","type":"page","link":"https:\/\/www.compu-links.com\/the-history","title":{"rendered":"The History"},"content":{"rendered":"<p>Twenty years ago, Compu-Links began with an epiphany: the digital revolution was enabling dozens of opportunities to automate information in the property sector.  Our team would build an environment for information engineers who could leverage this technology to innovate, automate and deliver value to their clients.<\/p>\n<p>Quickly, this idea was put into action.  In 1996, the founder took the plunge and Compu-Links was incorporated in the Commonwealth of Massachusetts.   Its information services began to gain traction among area businesses.  At first, Compu-Links served engineers, architects and utilities with facilities information solutions.  These firms and organizations had mountains of legacy records that needed to be modernized and housed in a database.  Compu-Links served these clients with considerable success.  And what started as a locally-focused service, found itself managing contracts dispersed across the USA.<\/p>\n<p>In the fast paced technology sector there is never a dull moment.  And as technology changed, Compu-Links diversified into geospatial information solutions (GIS).  Working for municipal Assessors departments Compu-Links built GIS solutions that linked Assessors maps with Assessors records. Compu-Links talented personnel then wrote an intuitive yet powerful ‘front end’ to enable searching, sorting, formatting and reporting of the data in a Windows environment.<\/p>\n<p>Building on this success, Compu-Links began a concerted effort to aggregate public information in eastern Massachusetts including Assessors data, parcel maps and transactional data from Registries of Deeds.  As luck would have it, at the same time the GPS sector was red hot – TomTom bought TeleAtlas and Garmin collaborated with Navteq.  All of these players needed data to drive their navigation solutions. Compu-Links adapted to this environment and these companies purchased our data.<\/p>\n<p>Shortly thereafter, our focus turned to real estate professionals who have a unique need for accurate and current public records and maps.  To fill that need, Compu-Links wrote a desktop computer application named g.Wiz!  The product was well received by area Realtors©.  In 2007, the internet drove Compu-Links to adapt these desktop applications to the web and to the cloud in an SaaS model and RealtyInSite was born. Today, on Cape Cod, RealtyInSite is used by thousands of real estate professionals as a mission critical information service enabling them to do their jobs more efficiently and more effectively.<\/p>\n<p>Looking ahead, Compu-Links will continue to innovate in the area of information services for professionals.  Our focus is on the built and unbuilt property markets, aggregating public records and geospatial information with easy to use search, analysis  and reporting functions.  We are driven by our proven 20-year record of adapting to technology cycles and successfully delivering value to our client base.  As a firm believer in the adage ‘you ain’t seen nothin’ yet’, Compu-Links looks forward to delivering to its clients the information they need to succeed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Twenty years ago, Compu-Links began with an epiphany: the digital revolution was enabling dozens of opportunities to automate information in the property sector.  Our team would build an environment for information engineers who could leverage this technology to innovate, automate<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/217"}],"collection":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/comments?post=217"}],"version-history":[{"count":5,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/217\/revisions"}],"predecessor-version":[{"id":256,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/217\/revisions\/256"}],"wp:attachment":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/media?parent=217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}