{"id":8,"date":"2016-01-06T14:14:14","date_gmt":"2016-01-06T14:14:14","guid":{"rendered":"http:\/\/www.201m.net\/compulink\/about-us-2\/"},"modified":"2018-04-04T06:19:13","modified_gmt":"2018-04-04T06:19:13","slug":"about-us-2","status":"publish","type":"page","link":"https:\/\/www.compu-links.com\/about-us-2","title":{"rendered":"About Us"},"content":{"rendered":"<p>Twenty years ago, Compu-Links began with an epiphany: that the digital revolution offered opportunities in the property sector and built environment to information engineers who could leverage technology, innovate and deliver value to clients.<\/p>\n<p>Shortly after, the idea was put to the test.  The founder took the plunge and Compu-Links was incorporated in the Commonwealth of Massachusetts.   Its information services began to resonate among area businesses.  More specifically, Compu-Links served engineers and architects and utilities with facilities information solutions.  These firms and organizations had mountains of legacy records that needed to be modernized and housed in a database.  Compu-Links served these clients with considerable success.  And what started as a locally-focused service, found itself managing contracts dispersed across the USA.<\/p>\n<p>In the technology sector there is never a dull moment.  And as technology changed Compu-Links diversified into geospatial information solutions.  Working for municipal Assessors departments Compu-Links began to build GIS solutions.  These solutions linked Assessors maps with Assessors records.  Seeing a need for an intuitive yet powerful ‘front end’, Compu-Links also wrote software.<\/p>\n<p>Subsequently, Compu-Links began a concerted effort to aggregate public information (Assessors maps and records) throughout New England.  As luck would have it, at the same time the GPS sector was red hot – TomTom bought TeleAtlas and Garmin collaborated with Navteq.  All of these players needed data to drive their maps.  Compu-Links was fortunate to be in the right place at the right time with the right data.<\/p>\n<p>Still, Realtors have their own special needs for Assessors records and maps.  To fill that need, Compu-Links wrote a desktop computer application named g.Wiz!  The products was well received. Again, technology propelled Compu-Links forward as applications moved to the web and to the cloud.  In response, Compu-Links built RealtyInSite to serve real estate professionals.  On Cape Cod alone, RealtyInSite is now a go-to service for area real estate professionals.<\/p>\n<p>Looking ahead, Compu-Links will undoubtedly continue to innovate in the area of information solutions for the built environment, public records geospatial information aggregation and customized software solutions that respond to the needs of professionals.  As a firm believer in the adage ‘you ain’t seen nothin’ yet’, Compu-Links looks forward to delivering to its clients the information they need to succeed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Twenty years ago, Compu-Links began with an epiphany: that the digital revolution offered opportunities in the property sector and built environment to information engineers who could leverage technology, innovate and deliver value to clients. Shortly after, the idea was put<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":50,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/8"}],"collection":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/comments?post=8"}],"version-history":[{"count":3,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/8\/revisions"}],"predecessor-version":[{"id":272,"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/pages\/8\/revisions\/272"}],"wp:attachment":[{"href":"https:\/\/www.compu-links.com\/wp-json\/wp\/v2\/media?parent=8"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}